tutorials/test.realGas/generatingProperties/forMixture/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.05005 0 0)
    (0.05005 0 0)
    (0.05005 0.001 0)
    (-0.05005 0.001 0)
    (-0.05005 0 0.001)
    (0.05005 0 0.001)
    (0.05005 0.001 0.001)
    (-0.05005 0.001 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1001 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)

        );
    }
    inlet
    {
	type empty;
	faces
	(
            (0 4 7 3)
	);
    }
    outlet
    {
        type empty;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
